In [134]:
import pandas as pd
import numpy as np
from IPython.display import display

def display_full_dataframe(df):
    with pd.option_context('display.max_rows', None, 'display.max_columns', None):
        display(df)

## Reading And Exploring Data

In [135]:
credit_card = pd.read_excel("Credit Banking_Project1.xls")

In [136]:
credit_card.columns

Index(['Sl No:', 'Customer', 'Age', 'City', 'Credit Card Product', 'Limit',
       'Company', 'Segment'],
      dtype='object')

In [137]:
credit_card['SI No:'] = credit_card['Sl No:'].copy()

In [138]:
credit_card.shape

(100, 9)

In [139]:
credit_card.head()

,Sl No:,Customer,Age,City,Credit Card Product,Limit,Company,Segment,SI No:
0,1,A1,0.928521,BANGALORE,Gold,500000,C1,Self Employed,1
1,2,A2,35.534551,CALCUTTA,Silver,100000,C2,Salaried_MNC,2
2,3,A3,11.559307,COCHIN,Platimum,10000,C3,Salaried_Pvt,3
3,4,A4,45.820278,BOMBAY,Platimum,10001,C4,Govt,4
4,5,A5,69.663948,BANGALORE,Platimum,10002,C5,Normal Salary,5

In [140]:
credit_card.isnull().sum()

Sl No:                 0
Customer               0
Age                    0
City                   0
Credit Card Product    0
Limit                  0
Company                0
Segment                0
SI No:                 0
dtype: int64

In [141]:
credit_card.tail()

,Sl No:,Customer,Age,City,Credit Card Product,Limit,Company,Segment,SI No:
95,96,A96,29.631637,CHENNAI,Silver,100000,C19,Salaried_Pvt,96
96,97,A97,20.611833,TRIVANDRUM,Platimum,10000,C20,Govt,97
97,98,A98,40.538985,CALCUTTA,Platimum,10001,C21,Normal Salary,98
98,99,A99,21.588666,CALCUTTA,Platimum,10002,C22,Self Employed,99
99,100,A100,23.607638,COCHIN,Silver,100000,C5,Salaried_MNC,100

In [142]:
credit_card.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Sl No:               100 non-null    int64
 1   Customer             100 non-null    object
 2   Age                  100 non-null    float64
 3   City                 100 non-null    object
 4   Credit Card Product  100 non-null    object
 5   Limit                100 non-null    int64
 6   Company              100 non-null    object
 7   Segment              100 non-null    object
 8   SI No:               100 non-null    int64
dtypes: float64(1), int64(3), object(5)
memory usage: 7.2+ KB

In [143]:
credit_card.describe

<bound method NDFrame.describe of     Sl No: Customer        Age        City Credit Card Product   Limit  \
0        1       A1   0.928521   BANGALORE                Gold  500000
1        2       A2  35.534551    CALCUTTA              Silver  100000
2        3       A3  11.559307      COCHIN            Platimum   10000
3        4       A4  45.820278      BOMBAY            Platimum   10001
4        5       A5  69.663948   BANGALORE            Platimum   10002
..     ...      ...        ...         ...                 ...     ...
95      96      A96  29.631637     CHENNAI              Silver  100000
96      97      A97  20.611833  TRIVANDRUM            Platimum   10000
97      98      A98  40.538985    CALCUTTA            Platimum   10001
98      99      A99  21.588666    CALCUTTA            Platimum   10002
99     100     A100  23.607638      COCHIN              Silver  100000

   Company        Segment  SI No:
0       C1  Self Employed       1
1       C2   Salaried_MNC       2
2       C3   Salaried_Pvt       3
3       C4           Govt       4
4       C5  Normal Salary       5
..     ...            ...     ...
95     C19   Salaried_Pvt      96
96     C20           Govt      97
97     C21  Normal Salary      98
98     C22  Self Employed      99
99      C5   Salaried_MNC     100

[100 rows x 9 columns]>

In [144]:
credit_card['Age']

0      0.928521
1     35.534551
2     11.559307
3     45.820278
4     69.663948
        ...
95    29.631637
96    20.611833
97    40.538985
98    21.588666
99    23.607638
Name: Age, Length: 100, dtype: float64

In [145]:
mean_age = credit_card[credit_card['Age'] > 18]['Age'].mean()

In [146]:
credit_card.loc[credit_card['Age'] < 18, 'Age'] = mean_age

In [147]:
credit_card['Age']

0     49.292424
1     35.534551
2     49.292424
3     45.820278
4     69.663948
        ...
95    29.631637
96    20.611833
97    40.538985
98    21.588666
99    23.607638
Name: Age, Length: 100, dtype: float64

## Reading repayment and spend sheet

In [148]:
spend = pd.read_excel("Credit Banking_Project1.xls", sheet_name = "Spend")

In [149]:
spend

      SI No: Costomer      Month        Type         Amount
0          1       A1 2004-01-12   JEWELLERY  473775.834869
1          2       A1 2004-01-03       PETRO  335578.666019
2          3       A1 2004-01-15     CLOTHES  371040.941912
3          4       A1 2004-01-25        FOOD  141177.813256
4          5       A1 2005-01-17      CAMERA  398403.771812
...      ...      ...        ...         ...            ...
1495    1496      A67 2006-02-04  BUS TICKET  195841.312215
1496    1497      A68 2006-03-25  BUS TICKET  284262.517709
1497    1498      A69 2006-03-31  BUS TICKET  206552.273598
1498    1499      A70 2006-03-23  BUS TICKET   41024.781283
1499    1500      A71 2006-03-24  BUS TICKET  101397.548588

[1500 rows x 5 columns]

In [150]:
repay = pd.read_excel("Credit Banking_Project1.xls", sheet_name = "Repayment")

In [151]:
repay

      SL No: Costomer      Month         Amount
0          1       A1 2004-01-12  331844.007374
1          2       A1 2004-01-03  441139.807335
2          3       A1 2004-01-15   32480.004009
3          4       A1 2004-01-25   90636.966534
4          5       A1 2005-01-17    1581.969829
...      ...      ...        ...            ...
1495    1496      A67 2005-05-09  200288.874065
1496    1497      A68 2006-05-10  231194.702295
1497    1498      A69 2006-07-11  391195.615836
1498    1499      A70 2005-08-12  357629.618186
1499    1500      A71 2004-09-13  179771.745248

[1500 rows x 4 columns]

In [152]:
repay['variation'] = repay['Amount'] - spend['Amount']

In [153]:
repay['surplus'] = repay['variation']*0.02

In [154]:
repay['surplus']

0      -2838.636550
1       2111.222826
2      -6771.218758
3      -1010.816934
4      -7936.436040
           ...
1495      88.951237
1496   -1061.356308
1497    3692.866845
1498    6332.096738
1499    1567.483933
Name: surplus, Length: 1500, dtype: float64

In [155]:
surplus_data = repay.drop(['variation'],axis=1)
surplus_data = surplus_data[surplus_data['surplus']>0]
surplus_data

      SL No: Costomer      Month         Amount      surplus
1          2       A1 2004-01-03  441139.807335  2111.222826
6          7       A1 2005-02-01  280990.709927  1232.974963
7          8       A8 2004-02-05  117697.053061  1147.908167
9         10      A10 2005-02-16  407418.805366  6726.031867
11        12      A12 2005-02-03  227656.566154  2663.728573
...      ...      ...        ...            ...          ...
1494    1495      A66 2006-05-08  419497.942321  8373.440204
1495    1496      A67 2005-05-09  200288.874065    88.951237
1497    1498      A69 2006-07-11  391195.615836  3692.866845
1498    1499      A70 2005-08-12  357629.618186  6332.096738
1499    1500      A71 2004-09-13  179771.745248  1567.483933

[712 rows x 5 columns]

In [159]:
surplus_data['next_billing_amount'] = surplus_data['Amount'] - surplus_data['surplus']

In [160]:
surplus_data

,SL No:,Costomer,Month,Amount,surplus,next_billing_amount
1,2,A1,2004-01-03,441139.807335,2111.222826,439028.584509
6,7,A1,2005-02-01,280990.709927,1232.974963,279757.734964
7,8,A8,2004-02-05,117697.053061,1147.908167,116549.144894
9,10,A10,2005-02-16,407418.805366,6726.031867,400692.773499
11,12,A12,2005-02-03,227656.566154,2663.728573,224992.837581
...,...,...,...,...,...,...
1494,1495,A66,2006-05-08,419497.942321,8373.440204,411124.502117
1495,1496,A67,2005-05-09,200288.874065,88.951237,200199.922828
1497,1498,A69,2006-07-11,391195.615836,3692.866845,387502.748991
1498,1499,A70,2005-08-12,357629.618186,6332.096738,351297.521448
1499,1500,A71,2004-09-13,179771.745248,1567.483933,178204.261315

## Monthly spend of each customer

In [167]:
spend['Month']

0       2004-01
1       2004-01
2       2004-01
3       2004-01
4       2005-01
         ...
1495    2006-02
1496    2006-03
1497    2006-03
1498    2006-03
1499    2006-03
Name: Month, Length: 1500, dtype: period[M]

In [169]:
monthly_spend = spend.groupby(['Costomer' , 'Month'])['Amount'].sum()

In [170]:
monthly_spend = pd.DataFrame(monthly_spend)

In [171]:
monthly_spend

                        Amount
Costomer Month
A1       2004-01  1.511173e+06
         2004-02  4.138111e+04
         2004-05  1.311966e+05
         2005-01  3.984038e+05
         2005-02  1.404193e+06
...                        ...
A95      2004-01  3.478339e+05
A96      2004-01  3.203635e+05
A97      2004-01  1.643300e+05
A98      2004-01  8.748351e+04
A99      2004-01  4.760204e+05

[807 rows x 1 columns]

## Monthly repayment of each customer

In [173]:
repay['Month'] = pd.to_datetime(repay['Month']).dt.to_period('M')

In [174]:
monthly_repay = repay.groupby(['Costomer' , 'Month'])['Amount'].sum()

In [175]:
monthly_repay = pd.DataFrame(monthly_repay)

In [176]:
monthly_repay

                        Amount
Costomer Month
A1       2004-01  1.362775e+06
         2004-02  1.911800e+05
         2005-01  1.581970e+03
         2005-02  1.199808e+06
         2005-07  3.005817e+05
...                        ...
A95      2004-01  7.510949e+04
A96      2004-01  1.101390e+05
A97      2004-01  1.746064e+05
A98      2004-01  9.780260e+04
A99      2004-01  3.585899e+05

[798 rows x 1 columns]

In [177]:
highest_10 = repay.groupby(['Costomer'])['Amount'].sum().nlargest(10)

In [178]:
highest_10

Costomer
A22    9.767171e+06
A60    9.262032e+06
A61    8.807888e+06
A40    8.805085e+06
A47    8.529826e+06
A43    8.458621e+06
A48    8.432804e+06
A41    8.374046e+06
A49    8.259841e+06
A45    8.115210e+06
Name: Amount, dtype: float64

## People in which segment are spending more money

In [179]:
spend = spend.rename(columns = {'Costomer':'Customer'})

In [180]:
spend

      SI No: Customer    Month        Type         Amount
0          1       A1  2004-01   JEWELLERY  473775.834869
1          2       A1  2004-01       PETRO  335578.666019
2          3       A1  2004-01     CLOTHES  371040.941912
3          4       A1  2004-01        FOOD  141177.813256
4          5       A1  2005-01      CAMERA  398403.771812
...      ...      ...      ...         ...            ...
1495    1496      A67  2006-02  BUS TICKET  195841.312215
1496    1497      A68  2006-03  BUS TICKET  284262.517709
1497    1498      A69  2006-03  BUS TICKET  206552.273598
1498    1499      A70  2006-03  BUS TICKET   41024.781283
1499    1500      A71  2006-03  BUS TICKET  101397.548588

[1500 rows x 5 columns]

In [181]:
merge_credit_spend = pd.merge(credit_card,spend,on = 'Customer',how = 'left')

In [182]:
merge_credit_spend

,Sl No:,Customer,Age,City,Credit Card Product,Limit,Company,Segment,SI No:_x,SI No:_y,Month,Type,Amount
0,1,A1,49.292424,BANGALORE,Gold,500000,C1,Self Employed,1,1,2004-01,JEWELLERY,473775.834869
1,1,A1,49.292424,BANGALORE,Gold,500000,C1,Self Employed,1,2,2004-01,PETRO,335578.666019
2,1,A1,49.292424,BANGALORE,Gold,500000,C1,Self Employed,1,3,2004-01,CLOTHES,371040.941912
3,1,A1,49.292424,BANGALORE,Gold,500000,C1,Self Employed,1,4,2004-01,FOOD,141177.813256
4,1,A1,49.292424,BANGALORE,Gold,500000,C1,Self Employed,1,5,2005-01,CAMERA,398403.771812
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1495,96,A96,29.631637,CHENNAI,Silver,100000,C19,Salaried_Pvt,96,98,2004-01,BIKE,320363.535698
1496,97,A97,20.611833,TRIVANDRUM,Platimum,10000,C20,Govt,97,99,2004-01,AUTO,164330.042270
1497,98,A98,40.538985,CALCUTTA,Platimum,10001,C21,Normal Salary,98,100,2004-01,SHOPPING,87483.511992
1498,99,A99,21.588666,CALCUTTA,Platimum,10002,C22,Self Employed,99,101,2004-01,AIR TICKET,476020.386647
1499,100,A100,23.607638,COCHIN,Silver,100000,C5,Salaried_MNC,100,102,2004-01,BUS TICKET,42254.191499

In [183]:
merge_credit_spend.isnull().sum()

Sl No:                 0
Customer               0
Age                    0
City                   0
Credit Card Product    0
Limit                  0
Company                0
Segment                0
SI No:_x               0
SI No:_y               0
Month                  0
Type                   0
Amount                 0
dtype: int64

In [184]:
segment_spent = merge_credit_spend.groupby('Segment')['Amount'].sum()

In [185]:
segment_spent = pd.DataFrame(segment_spent)

In [186]:
segment_spent

                     Amount
Segment
Govt           6.732563e+07
Normal Salary  1.077071e+08
Salaried_MNC   6.363949e+07
Salaried_Pvt   7.170431e+07
Self Employed  7.097548e+07

In [187]:
segment_spent.max()

Amount    1.077071e+08
dtype: float64

In [188]:
max_spending = segment_spent.idxmax()
max_spending

Amount    Normal Salary
dtype: object

## Which age group is spending more money?

In [189]:
age_ranges = [18,25,30,35,40,45,50,55,60,65]
merge_credit_spend['Age Group'] = pd.cut(merge_credit_spend['Age'],bins = age_ranges , labels = ['18-25','25-30','30-35','35-40','40-45','45-50','50-55','55-60','60-65'])
age_group_spending = merge_credit_spend.groupby('Age Group')['Amount'].sum()
max_spending_age_group = print(age_group_spending.idxmax())

45-50

In [190]:
repay = repay.rename(columns = {'Costomer':'Customer'})

In [191]:
repay

      SL No: Customer    Month         Amount      variation      surplus
0          1       A1  2004-01  331844.007374 -141931.827495 -2838.636550
1          2       A1  2004-01  441139.807335  105561.141316  2111.222826
2          3       A1  2004-01   32480.004009 -338560.937903 -6771.218758
3          4       A1  2004-01   90636.966534  -50540.846722 -1010.816934
4          5       A1  2005-01    1581.969829 -396821.801983 -7936.436040
...      ...      ...      ...            ...            ...          ...
1495    1496      A67  2005-05  200288.874065    4447.561849    88.951237
1496    1497      A68  2006-05  231194.702295  -53067.815415 -1061.356308
1497    1498      A69  2006-07  391195.615836  184643.342238  3692.866845
1498    1499      A70  2005-08  357629.618186  316604.836903  6332.096738
1499    1500      A71  2004-09  179771.745248   78374.196661  1567.483933

[1500 rows x 6 columns]

In [192]:
merged_repay_spend = pd.merge(repay,merge_credit_spend,on = 'Customer',how = 'left')
print(merged_repay_spend.head(10))

   SL No: Customer  Month_x       Amount_x      variation     surplus  Sl No:  \
0       1       A1  2004-01  331844.007374 -141931.827495 -2838.63655       1
1       1       A1  2004-01  331844.007374 -141931.827495 -2838.63655       1
2       1       A1  2004-01  331844.007374 -141931.827495 -2838.63655       1
3       1       A1  2004-01  331844.007374 -141931.827495 -2838.63655       1
4       1       A1  2004-01  331844.007374 -141931.827495 -2838.63655       1
5       1       A1  2004-01  331844.007374 -141931.827495 -2838.63655       1
6       1       A1  2004-01  331844.007374 -141931.827495 -2838.63655       1
7       1       A1  2004-01  331844.007374 -141931.827495 -2838.63655       1
8       1       A1  2004-01  331844.007374 -141931.827495 -2838.63655       1
9       1       A1  2004-01  331844.007374 -141931.827495 -2838.63655       1

         Age       City Credit Card Product   Limit Company        Segment  \
0  49.292424  BANGALORE                Gold  500000      C1  Self Employed
1  49.292424  BANGALORE                Gold  500000      C1  Self Employed
2  49.292424  BANGALORE                Gold  500000      C1  Self Employed
3  49.292424  BANGALORE                Gold  500000      C1  Self Employed
4  49.292424  BANGALORE                Gold  500000      C1  Self Employed
5  49.292424  BANGALORE                Gold  500000      C1  Self Employed
6  49.292424  BANGALORE                Gold  500000      C1  Self Employed
7  49.292424  BANGALORE                Gold  500000      C1  Self Employed
8  49.292424  BANGALORE                Gold  500000      C1  Self Employed
9  49.292424  BANGALORE                Gold  500000      C1  Self Employed

   SI No:_x  SI No:_y  Month_y          Type       Amount_y Age Group
0         1         1  2004-01     JEWELLERY  473775.834869     45-50
1         1         2  2004-01         PETRO  335578.666019     45-50
2         1         3  2004-01       CLOTHES  371040.941912     45-50
3         1         4  2004-01          FOOD  141177.813256     45-50
4         1         5  2005-01        CAMERA  398403.771812     45-50
5         1         6  2005-02       SANDALS  429084.568141     45-50
6         1         7  2005-02           CAR  219341.961771     45-50
7         1       103  2004-01  TRAIN TICKET   52225.052808     45-50
8         1       117  2004-02    BUS TICKET   41381.105869     45-50
9         1       131  2006-04    AIR TICKET  266518.449788     45-50

## Most profitable segment

In [193]:
segment_repayment = merged_repay_spend.groupby('Segment')['Amount_x'].sum()
segment_repayment = pd.DataFrame(segment_repayment)
segment_repayment

                   Amount_x
Segment
Govt           1.549330e+09
Normal Salary  2.476206e+09
Salaried_MNC   1.599110e+09
Salaried_Pvt   1.771235e+09
Self Employed  1.803293e+09

In [211]:
profitable_segment = segment_repayment['Amount_x'] - segment_spent['Amount']
profitable_segment = pd.DataFrame(profitable_segment)
profitable_segment = profitable_segment.rename(columns={'0':'Amount'})
profitable_segment

                          0
Segment
Govt           1.482004e+09
Normal Salary  2.368499e+09
Salaried_MNC   1.535471e+09
Salaried_Pvt   1.699531e+09
Self Employed  1.732317e+09

In [213]:
profitable_segment.idxmax()

0    Normal Salary
dtype: object

## Maximum spending category

In [214]:
max_spend_category = spend.groupby('Type')['Amount'].sum()
print(max_spend_category.idxmax())

PETRO

In [215]:
spend['Type'].unique()

array(['JEWELLERY', 'PETRO', 'CLOTHES', 'FOOD', 'CAMERA', 'SANDALS',
       'CAR', 'BIKE', 'AUTO', 'SHOPPING', 'AIR TICKET', 'BUS TICKET',
       'TRAIN TICKET', 'RENTAL', 'MOVIE TICKET'], dtype=object)

In [216]:
group_mapping = {
    'JEWELLERY' : 'FASHION AND ACCESORIES',
    'PETRO' : 'VEHICLE COSTS',
    'CLOTHES' : 'FASHION AND ACCESORIES',
    'FOOD' : 'FOOD',
    'CAMERA' : 'OTHERS',
    'SANDALS' : 'FASHION AND ACCESORIES',
    'CAR' : 'VEHICLE COSTS',
    'BIKE' : 'VEHICLE COSTS',
    'AUTO' : 'VEHICLE COSTS',
    'SHOPPING' : 'FASHION AND ACCESORIES',
    'AIR TICKET' : 'TRAVELING EXPENSES',
    'BUS TICKET' : 'TRAVELING EXPENSES',
    'TRAIN TICKET': 'TRAVELING EXPENSES',
    'RENTAL' : 'OTHERS',
    'MOVIE TICKET' : 'OTHERS'
}
spend['category'] = spend['Type'].replace(group_mapping)
category = spend['category'].value_counts()
category.idxmax()

'TRAVELING EXPENSES'

## Monthly profit of Bank and customer Payment of each month

In [286]:
due_amount = monthly_spend['Amount'] - monthly_repay['Amount']

In [287]:
due_amount

Costomer  Month
A1        2004-01    148397.511160
          2004-02   -149798.905749
          2004-05              NaN
          2005-01    396821.801983
          2005-02    204385.417375
                         ...
A95       2004-01    272724.387296
A96       2004-01    210224.521550
A97       2004-01    -10276.350013
A98       2004-01    -10319.087003
A99       2004-01    117430.462302
Name: Amount, Length: 1102, dtype: float64

In [288]:
due_amount = due_amount[due_amount > 0]

In [289]:
due_amount

Costomer  Month
A1        2004-01    148397.511160
          2005-01    396821.801983
          2005-02    204385.417375
          2005-11    178830.483153
          2006-04    193233.582587
                         ...
A93       2004-01    292417.152847
A94       2004-01    185734.381769
A95       2004-01    272724.387296
A96       2004-01    210224.521550
A99       2004-01    117430.462302
Name: Amount, Length: 266, dtype: float64

In [290]:
interest_amount = due_amount * 0.029

In [291]:
customer_pay = due_amount + interest_amount

In [292]:
customer_pay = pd.DataFrame(due_amount)
customer_pay

                         Amount
Costomer Month
A1       2004-01  148397.511160
         2005-01  396821.801983
         2005-02  204385.417375
         2005-11  178830.483153
         2006-04  193233.582587
...                         ...
A93      2004-01  292417.152847
A94      2004-01  185734.381769
A95      2004-01  272724.387296
A96      2004-01  210224.521550
A99      2004-01  117430.462302

[266 rows x 1 columns]

In [293]:
customer_pay.shape

(266, 1)

In [294]:
customer_pay.index

MultiIndex([( 'A1', '2004-01'),
            ( 'A1', '2005-01'),
            ( 'A1', '2005-02'),
            ( 'A1', '2005-11'),
            ( 'A1', '2006-04'),
            ('A10', '2004-03'),
            ('A10', '2006-03'),
            ('A11', '2005-08'),
            ('A12', '2004-01'),
            ('A12', '2004-02'),
            ...
            ('A89', '2006-04'),
            ( 'A9', '2004-01'),
            ( 'A9', '2005-02'),
            ( 'A9', '2006-02'),
            ('A90', '2006-04'),
            ('A93', '2004-01'),
            ('A94', '2004-01'),
            ('A95', '2004-01'),
            ('A96', '2004-01'),
            ('A99', '2004-01')],
           names=['Costomer', 'Month'], length=266)

In [295]:
customer_pay.reset_index(inplace=True)

In [296]:
customer_pay.columns

Index(['Costomer', 'Month', 'Amount'], dtype='object')

In [297]:
customer_pay['Year-Month'] = customer_pay['Month'].dt.strftime('%Y-%m')

# Group the data by the new 'Year-Month' column and calculate the sum of 'Amount' for each group
monthly_profit = customer_pay.groupby('Year-Month')['Amount'].sum().reset_index()

# Display the monthly_profit DataFrame
print(monthly_profit)

   Year-Month        Amount
0     2004-01  1.669592e+07
1     2004-02  1.272078e+06
2     2004-03  6.395781e+05
3     2004-04  1.011751e+06
4     2004-05  5.481677e+05
5     2004-09  6.328051e+03
6     2004-11  7.552561e+05
7     2005-01  1.675321e+06
8     2005-02  1.094188e+07
9     2005-04  1.238887e+06
10    2005-05  8.618317e+06
11    2005-06  3.367130e+06
12    2005-07  4.150490e+05
13    2005-08  1.569154e+06
14    2005-09  5.185326e+05
15    2005-10  1.456398e+05
16    2005-11  3.359889e+06
17    2005-12  1.898293e+05
18    2006-01  1.175653e+06
19    2006-02  1.739579e+06
20    2006-03  1.592058e+07
21    2006-04  7.482892e+06
22    2006-05  2.171171e+06
23    2006-06  2.753837e+05
24    2006-07  1.272987e+06
25    2006-08  1.088685e+05
26    2006-09  4.007289e+05
27    2006-10  6.614960e+05
28    2006-11  1.712678e+06
29    2006-12  2.212683e+05